#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 0s [id=projects/-/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iam.googleapis.com]
module.enable_google_apis.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/sts.googleapis.com]
google_iam_workload_identity_pool.mypool: Refreshing state... [id=projects/youtube-data-api-385206/locations/global/workloadIdentityPools/mypool]
module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/pubsub.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudscheduler.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudscheduler.googleapis.com]
module.enable_google_apis.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/artifactregistry.googleapis.com]
google_service_account.invoker: Refreshing state... [id=projects/youtube-data-api-385206/serviceAccounts/cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/secretmanager.googleapis.com]
data.google_service_account.terraform_sa: Reading...
google_service_account.app: Refreshing state... [id=projects/youtube-data-api-385206/serviceAccounts/youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/youtube-data-api-385206/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/run.googleapis.com]
module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/storage.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudresourcemanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/bigquery.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iamcredentials.googleapis.com]
google_project_iam_member.app[0]: Refreshing state... [id=youtube-data-api-385206/roles/bigquery.jobUser/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.invoker: Refreshing state... [id=youtube-data-api-385206/roles/run.invoker/serviceAccount:cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[3]: Refreshing state... [id=youtube-data-api-385206/roles/pubsub.publisher/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["youtube.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/youtube.googleapis.com]
google_project_iam_member.app[4]: Refreshing state... [id=youtube-data-api-385206/roles/storage.objectCreator/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[1]: Refreshing state... [id=youtube-data-api-385206/roles/bigquery.dataEditor/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[2]: Refreshing state... [id=youtube-data-api-385206/roles/run.serviceAgent/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[5]: Refreshing state... [id=youtube-data-api-385206/roles/secretmanager.secretAccessor/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.myprovider: Refreshing state... [id=projects/youtube-data-api-385206/locations/global/workloadIdentityPools/mypool/providers/myprovider]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/youtube-data-api-385206/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/1051886801059/locations/global/workloadIdentityPools/mypool/attribute.repository/Kamegrueon/youtube_data_api]
google_pubsub_topic.main: Refreshing state... [id=projects/youtube-data-api-385206/topics/youtube-data-api]
google_storage_bucket.bucket: Refreshing state... [id=youtube-data-api-385206-youtube-data-api]
google_artifact_registry_repository.repository: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/repositories/youtube-data-api-repository]
google_pubsub_topic_iam_member.topic_publisher_role: Refreshing state... [id=projects/youtube-data-api-385206/topics/youtube-data-api/roles/pubsub.publisher/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_pubsub_topic.main_dead_letter: Refreshing state... [id=projects/youtube-data-api-385206/topics/youtube-data-api-dlq]
google_storage_bucket_iam_member.member: Refreshing state... [id=b/youtube-data-api-385206-youtube-data-api/roles/storage.admin/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_cloud_run_v2_service.api: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/services/youtube-data-api-api]
google_pubsub_subscription.main: Refreshing state... [id=projects/youtube-data-api-385206/subscriptions/youtube-data-api-sub]
google_cloud_scheduler_job.invoke-transfer: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/jobs/invoke-transfer]
google_pubsub_subscription_iam_member.subscription_subscriber_role: Refreshing state... [id=projects/youtube-data-api-385206/subscriptions/youtube-data-api-sub/roles/pubsub.subscriber/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service_iam_member.api_invoker will be created
  + resource "google_cloud_run_service_iam_member" "api_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "serviceAccount:cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com"
      + project  = "youtube-data-api-385206"
      + role     = "roles/run.invoker"
      + service  = "youtube-data-api-api"
    }

  # google_cloud_run_v2_service.api is tainted, so must be replaced
-/+ resource "google_cloud_run_v2_service" "api" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - last_transition_time = "2024-05-20T07:36:19.269198Z"
              - message              = <<-EOT
                    Revision 'youtube-data-api-api-00001-cvv' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=youtube-data-api-385206&resource=cloud_run_revision/service_name/youtube-data-api-api/revision_name/youtube-data-api-api-00001-cvv&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22youtube-data-api-api%22%0Aresource.labels.revision_name%3D%22youtube-data-api-api-00001-cvv%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "RoutesReady"
                # (3 unchanged attributes hidden)
            },
          - {
              - last_transition_time = "2024-05-20T07:32:09.307549Z"
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "ConfigurationsReady"
                # (5 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ create_time             = "2024-05-20T07:32:09.216202Z" -> (known after apply)
      ~ creator                 = "terraform@youtube-data-api-385206.iam.gserviceaccount.com" -> (known after apply)
      - custom_audiences        = [] -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ effective_labels        = {} -> (known after apply)
      ~ etag                    = "\"CPn4q7IGEJD2i2c/cHJvamVjdHMveW91dHViZS1kYXRhLWFwaS0zODUyMDYvbG9jYXRpb25zL2FzaWEtbm9ydGhlYXN0MS9zZXJ2aWNlcy95b3V0dWJlLWRhdGEtYXBpLWFwaQ\"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "1" -> (known after apply)
      ~ id                      = "projects/youtube-data-api-385206/locations/asia-northeast1/services/youtube-data-api-api" -> (known after apply)
      - labels                  = {} -> null
      ~ last_modifier           = "terraform@youtube-data-api-385206.iam.gserviceaccount.com" -> (known after apply)
      ~ latest_created_revision = "projects/youtube-data-api-385206/locations/asia-northeast1/services/youtube-data-api-api/revisions/youtube-data-api-api-00001-cvv" -> (known after apply)
      ~ latest_ready_revision   = "projects/youtube-data-api-385206/locations/asia-northeast1/services/youtube-data-api-api/revisions/youtube-data-api-api-00001-cvv" -> (known after apply)
      ~ launch_stage            = "GA" -> (known after apply)
        name                    = "youtube-data-api-api"
      ~ observed_generation     = "1" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - last_transition_time = "2024-05-20T07:36:19.269198Z"
              - message              = <<-EOT
                    Revision 'youtube-data-api-api-00001-cvv' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=youtube-data-api-385206&resource=cloud_run_revision/service_name/youtube-data-api-api/revision_name/youtube-data-api-api-00001-cvv&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22youtube-data-api-api%22%0Aresource.labels.revision_name%3D%22youtube-data-api-api-00001-cvv%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "Ready"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ terraform_labels        = {} -> (known after apply)
      ~ traffic_statuses        = [] -> (known after apply)
      ~ uid                     = "7bea78bf-d744-4a74-a614-801abc394b15" -> (known after apply)
      ~ update_time             = "2024-05-20T07:32:09.216202Z" -> (known after apply)
      + uri                     = (known after apply)
        # (6 unchanged attributes hidden)

      ~ template {
          - annotations                      = {} -> null
          - labels                           = {} -> null
          ~ max_instance_request_concurrency = 80 -> (known after apply)
          - session_affinity                 = false -> null
          ~ timeout                          = "300s" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ containers {
              - args        = [] -> null
              - command     = [] -> null
              - depends_on  = [] -> null
                name        = null
                # (2 unchanged attributes hidden)

              - ports {
                  - container_port = 8080 -> null
                  - name           = "http1" -> null
                }

              ~ resources {
                  - startup_cpu_boost = false -> null
                    # (2 unchanged attributes hidden)
                }

              - startup_probe {
                  - failure_threshold     = 1 -> null
                  - initial_delay_seconds = 0 -> null
                  - period_seconds        = 240 -> null
                  - timeout_seconds       = 240 -> null

                  - tcp_socket {
                      - port = 8080 -> null
                    }
                }

                # (7 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_scheduler_job.invoke-transfer will be updated in-place
  ~ resource "google_cloud_scheduler_job" "invoke-transfer" {
        id               = "projects/youtube-data-api-385206/locations/asia-northeast1/jobs/invoke-transfer"
        name             = "invoke-transfer"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke/transfer" -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ oidc_token {
              - audience              = "https://youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke/transfer" -> null
                # (1 unchanged attribute hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # google_pubsub_subscription.main will be updated in-place
  ~ resource "google_pubsub_subscription" "main" {
        id                           = "projects/youtube-data-api-385206/subscriptions/youtube-data-api-sub"
        name                         = "youtube-data-api-sub"
        # (11 unchanged attributes hidden)

      ~ push_config {
          ~ push_endpoint = "https://youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke/load" -> (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @Kamegrueon, Action: `pull_request`, Working Directory: ``, Workflow: `cicd`*